myapp/app/controllers/pessoas_controller.rb

SELECT "pessoas".* FROM "pessoas" WHERE "pessoas"."lote" = ? ORDER BY preco DESC  [["lote", "1613138119"]]
---
  def create
    @response = ImportarService.call params[:arquivo]
    unless @response
      flash[:notice] = 'Extensão inválida'
      render :index
    else
      flash[:notice] = 'Dados importados com sucesso'
      @pessoas = Pessoa.where(:lote => @response[:lote])
                       .order('preco DESC')